system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    extractedFacesTop;  
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (0.0 0.0231 -0.01) (0.00127 0.0233 0.01);   
        }
    }
   
   
    // creation of the faceZone (from the above faceSet)
    {
        name    massFlowSurfaceTop;
        type    faceZoneSet;
        action  new;
        source  setAndNormalToFaceZone;
        sourceInfo
        {
            faceSet extractedFacesTop;
            normal (0    -1    0);
        }
    }

    {
        name    extractedFacesBottom;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (0.0 0.0199 -0.01) (0.00127 0.0201 0.01);
        }
    }


    // creation of the faceZone (from the above faceSet)
    {
        name    massFlowSurfaceBottom;
        type    faceZoneSet;
        action  new;
        source  setAndNormalToFaceZone;
        sourceInfo
        {
            faceSet extractedFacesBottom;
            normal (0    -1    0);
        }
    }




);


// ************************************************************************* //
